Autodesk.Navisworks.Api.SavedItemReference
Represents a reference to a saved item. Immutable.

Autodesk.Navisworks.Api.SavedItemReference.#ctor
Creates an empty reference.

Autodesk.Navisworks.Api.SavedItemReference.#ctor(Autodesk.Navisworks.Api.SavedItemReference)
Creates a copy of a saved item reference.
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SavedItemReference.#ctor(System.String,System.String)
Creates a reference to a saved item in a document part.
Throws System.ArgumentException:
Argument 'documentPartId' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.SavedItemReference.DisplayString
Display string for the reference.

Autodesk.Navisworks.Api.SavedItemReference.DocumentPartId
Identifies the document part containing the item.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItemReference.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.SavedItemReference.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.SavedItemReference.IsNull
True if this doesn't reference any saved item.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItemReference.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SavedItemReference.SavedItemId
Identifies a saved item within a particular document part.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SavedItemReference.ToString
Returns a  that represents the current .
Returns: A  that represents the current .